<template>
  <section class="card">
    <h1>Описание проекта</h1>
    <p>
      - На странице "Все задачи" можно смотреть созданные задачи. Если их нет,
      то будет отображаться текст, что список задач пуст. Задачи загружаются с
      сервера во Vuex.
    </p>
    <p>
      - Можно смотреть каждую задачу отдельно, которая откырается по
      динамическому роуту, отталкиваясь от id каждой задачи.
    </p>
    <p>
      - В каждой задаче можно менять статус. Используется метод Patch. При этом
      сразу меняется текст и бордер бейджа, как в карточке данной задачи, так и
      в общем списке задач.
    </p>
    <p>
      - На странице "Создать задачу" надо заполнить форму, данные с которой
      собираются и отправляются на сервер. После сабмита формы происходит
      роутинг на страницу "Все задачи". Применена минимальная валидация,
      количество знаков в инпутах Названия и Описания должно быть более 3.
    </p>
    <p>
      - В качестве сервера выступает сервис гугла FireBase. С помощью Axios,
      туда сохраняются все данные (метод Post) и оттуда они забираются (метод
      Get).
    </p>
    <p>
      - Приложение не адаптированно и применена минимальная стилизация CSS без
      БЭМ.
    </p>
    <hr />
    <ul>
      <li>
        <router-link to="/">Главная</router-link>
      </li>
      <li>
        <router-link to="/tasks">Все задачи</router-link>
      </li>
      <li>
        <router-link to="/new">Создать задачу</router-link>
      </li>
    </ul>
  </section>
</template>
